"""
N개의 건물과 M개의 도로로 구성되어 있는 마을이 있다.
도로는 건물과 건물 사이에 놓여 있으며, 일방 통행 도로이다.
건물의 번호는 1번부터 N번까지 각각 주어져있다.
원철이는 마을의 도로를 따라 운동을 하기 위한 경로를 찾으려고 한다.
운동을 한 후에는 다시 시작점으로 돌아오는 것이 편하기 때문에, 원철이는 사이클을 찾기를 원한다.
단, 운동을 하는 도중 무슨 일이 생길지 모르므로, 사이클을 이루는 도로의 길이의 합이 최소가 되도록 찾으려고 한다.
도로의 정보가 주어졌을 때, 도로의 길이의 합이 가장 작은 사이클을 찾는 프로그램을 작성하시오.
두 마을을 왕복하는 경우도 사이클에 포함됨에 주의하시오.

[입력]
첫 줄에 테스트케이스의 개수 T가 주어진다. (1 ≤ T ≤ 20)
각 테스트 케이스의 첫 번째 줄에 건물의 수 N과 도로의 수 M이 주어진다. (2 ≤ N ≤ 400, 2 ≤ M ≤ N*(N-1))
각 테스트 케이스의 두 번째 줄부터 M개의 줄에 걸쳐 도로의 정보 s, e, c가 주어진다.
이는 s번 건물으로부터 e번 건물으로 이동하는 길이 c의 일방 통행 도로가 있다는 의미이다.
거리는 10,000 이하의 자연수이고, 같은 시작점과 도착점을 가진 간선은 최대 한 개 등장한다.

[출력]
각 테스트케이스마다 한 줄에 걸쳐, 테스트케이스 수 “#(TC) “를 출력하고, 도로의 길이의 합이 가장 작은 사이클의 길이를 출력한다. 만약, 그러한 사이클을 찾을 수 없다면 -1을 출력한다.
"""

#플로이드 워셜에서 사이클을 찾아보자

INF = 10**18

def floyd():
    for k in range(n+1):
        for i in range(n+1):
            if arr[i][k] == INF:
                continue

            ik = arr[i][k]
            for j in range(n+1):
                if arr[k][j] == INF:
                    continue

                if arr[i][j] > ik + arr[k][j]:
                    arr[i][j] = ik + arr[k][j]


T = int(input())
for tc in range(1, T+1):
    n, m = map(int, input().split())

    #자기 자신으로 가는 경로의 길이를 0으로 설정하지 않고 실행하면 끝
    arr = [[INF] * (n + 1) for _ in range(n + 1)]
    for _ in range(m):
        s, e, c = map(int, input().split())
        arr[s][e] = c

    floyd()
    
    #자기 자신으로 되돌아오는 경우들에서 최소 찾기
    ans = INF
    for i in range(n+1):
        cur = arr[i][i]
        ans = min (ans, cur)

    print(f"#{tc} {ans}")